cases/chpt4-aluminum-Marg-dsdT-zero/constant/Tref
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "constant";
    object      Tref;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 302.78;

boundaryField
{
    hot
    {
        type            calculated;
        value           uniform 302.78;
    }
    cold
    {
        type            calculated;
        value           uniform 302.78;
    }
    top
    {
        type            calculated;
        value           uniform 302.78;
    }
    btm
    {
        type            calculated;
        value           uniform 302.78;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
